Tekla Open API Reference for Tekla Structures 2025
Part.AssemblyNumber Property
 Gets or sets the assembly number. Defines the numbering in the assembly sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumberingSeries AssemblyNumber { get; set; }
Public Property AssemblyNumber As NumberingSeries
	Get
	Set
Property Value
Type: NumberingSeries
See Also
Reference
Part Class
Tekla.Structures.Model Namespace